* Trashpanda

** Хто ми?

   Ми команда незежних розробників під назвою Trashpanda Team, спеціалізуємося на створенні, 
   просуванні та підтримці ІТ продуктів для середніх та малих фірм написаних нами. 

** Команда

*** Сергій Різничук
    Розробник та менеджер по проектах.
  
*** Юлія Бурмич
    Розробник, графічний дизайнер, графік, бек-енд розробник.
   
*** Александр Шінковський
    Розробник, графічний дизайнер, архітектор візуальної складової. 

** Цілі

   1. Підтримка малих та середніх фірм, на рівні автоматизації логічний процесів. 

   2. Розширення клінтської бази продуктами власної лінії.
   
** Чому ми?

   1. Локальна підтримка і сервіс на місці.

   2. Повна адаптація продукту під клієнта. 

   3. Доступ до процесу розробки і повне відслідковування змін в продукті.

   4. Сервісування даних.


* Jarman 

** Що таке джарман?
   
   Система для керування фірмовими даними та документообігом.
   
** Вимагання на котрі відповідає продукт  

   - Керування працівниками та кліентами.
   - Керування доступами.
   - Робота з даними, та групування даних.
   - Можливість генерування звітностей у форматі ~.odt~.
   - (планується) Витягування та впроваджування даних з Excel таблиць. 
   - Розгортання структури для робочих станцій.
   - Інсталяція на ізольований сервер.
   - Підтримка резервних копій даних.
   
** Demo 
   
* Логіка

** Підтримка миттєва 
  - Телефонні дзвінки 
  - Виправлення проблем з локальною копією програми
  - Проведення навчань по роботі з програмою
  - Узгодження чи питання
  - Звітність по виконаній роботі

** Сервіс щомісячний
  - Діагностика даних, виправлення помилок
  - Постійний моніторинг системи
  - Висилання звітностей відносно пройдених згори пунктів

** Інфраструктура

  - Збереження копій даних
  - Серверна діагностика та виправлення
  - Розширення інфраструктури 
  - Повне системне адміністрування
  
* Оновлення 

  - Стандартна бізнес процедура в коді стосується змін до так званих Розширень. 
  - Можливість впливати на глобальні зміни в проекті.
    
* Розширення

  - Модифікація та створення Розширення.
  - Добровільна можливість зробити його публічним.
  - Створення плагіна лишень з умовою співробітництва 2+ місяці. 
  - Повне звітування та онлайновий доступ до внутрішніх правок по плагінах. 

* Планування

  - курси.
  - аналітика.

* Ситема послуг та ціни 

  |-------------------------------------------------------------+--------|
  | Послуга                                                     |      $ |
  |-------------------------------------------------------------+--------|
  | Розгортання інфраструктури (інсталяція)                     | 117.00 |
  | Підтримка миттєва(сума за міс. всіх сервісних днів) на день |   7.80 |
  | Підтримка місячна                                           |  10.80 |
  | Кошт забезпечення інфраструктури                            |      2 |
  | Аналітика, Навчання                                         |   0.00 |
  | Розширення                                                  |   0.00 |

* How contarct must be look like
  - When subscribtions start workig?
  - How much it cost?
    
    ~alias julka  == local serviser~

    |---------------------------------------------+----------|
    | expences trashpanda team                    | price($) |
    |---------------------------------------------+----------|
    | mainting trashpanda server infrustracture   | 30       |
    | trashpanda team                             | 0        |
    |---------------------------------------------+----------|
    | stable service stuf                         | price($) |
    |---------------------------------------------+----------|
    | call to julka in problem                    | 5/day    |
    | Mounthly supported data + raports           | -        |
    | learning the systems                        | 10       |
    | kanban board per client                     | 2        |
    | wrting custom plugins                       | -        |
    | ssh public ip + SSL                         | -        |
    |---------------------------------------------+----------|
    | related mounthly service stuf (0-n)         | price($) |
    |---------------------------------------------+----------|
    | sdd down and replace + recufnigurate system | -        |
    | setup hole environment                      | 30       |
    #+TBLFM: $2=(10+10)

* Mounthly supporter with rapport
  - Diagnoeses your data
  - look on your logs
  - raport abount backups and stored information from client

* learning the systems
  - Teaching course of using jarman and plugins.
    
* mainting trashpanda server infrustracture
  - Payments for server/backup-server by trahspnda team side
    - server
    - expading server infrastcutre
    - proprietary soft we using
    - internet abonament payment
    - electrisity usage payment
    - maybe public addresses + SSL
    - on handle crashes on server side

* trashpanda team
  - tips (currently not calculated)

* Writing update for our systems
  - donate for changing jarman update strutegy
    
* Writing custom plugins
** With servicing
   - modificate or create new plugins
   - make plugin owned by you or make it public for other
   - Make plugins allow only in 2+ mounth service
   - service must be start for 3+ mounth.
** Without servicing
   - full price for all thing we can give to client
   - long time to unsvering on problems
   - no trello dashboard
   - no ssh infracture 
   - no backup 


